// backend/models/Product.js
//

import mongoose from "mongoose";

const productSchema = new mongoose.Schema({
  // --------------------------------------------------
  // 상품 번호
  // --------------------------------------------------
  id: {
    type: Number,
    required: true,
    unique: true,
  },

  // --------------------------------------------------
  // 상품명
  // --------------------------------------------------
  name: {
    type: String,
    required: true,
  },

  // --------------------------------------------------
  // 상품 설명
  // --------------------------------------------------
  description: {
    type: String,
    required: true,
  },

  // --------------------------------------------------
  // 가격
  // --------------------------------------------------
  price: {
    type: Number,
    required: true,
  },

  // --------------------------------------------------
  // 태그
  //
  // 예:
  // ["전자제품", "노트북"]
  // --------------------------------------------------
  tags: {
    type: [String],
    default: [],
  },

  // --------------------------------------------------
  // 만든 날짜
  // --------------------------------------------------
  createdAt: {
    type: Date,
    default: Date.now,
  },

  // --------------------------------------------------
  // 수정 날짜
  // --------------------------------------------------
  updatedAt: {
    type: Date,
    default: Date.now,
  },
});

const Product = mongoose.model("Product", productSchema);

export default Product;